/**
* @mainpage
* # Загальне завдання
* 1. У кожному рядку двовимірного масиву **знайти** парні додатні числа 
* та **записати** їх y результуючий одновимірний масив. 
* @author Lavka O.
* @date 20-dec-2020
* @version 1.0
*/

/**
* @file main.c
* 
* @brief Файл з демонстрацією роботи структури та методів
* оперування ним.
*
* @author Lavka O.
* @date 20-dec-2020
* @version 1.0
*/
#include <stdio.h>
#define size 3

/**
* Головна функція.
*
* Послідовність дій:
* - оголошення змінних 
*	@param mas[][] двовимірний масив
*	@param res[] результуючий масив
*	@param a індекс елементів результуючого масиву 
*	@param *pRes покажчик на результуючий масив
* - заповнення двовимірного масиву випадковими цілими числами
* - перевірка числа кожного рядка масива на парність та додатність
* - занесення у результуючий масив парних та додатніх чисел 
*
*/
int main(){
int mas[size][size];
int res[size*size] = {0};
int a = 0;
int *pRes = res;
for(int i = 0; i < size; i++){
	printf("\n");
	for(int j = 0; j < size; j++){
		*(*(mas+i)+j) = rand()%100;
		printf("%d ", mas[i][j]);
	}
}
printf("\n\n\n");

for(int i = 0; i < size; i++){
	for(int j = 0; j < size; j++){
		if( ((*(*(mas+i)+j))%2) == 0 && *(*(mas+i)+j) > 0){
		 pRes[a] = *(*(mas+i)+j);
		 printf("%d ", res[a]);
		 a++;
		}
	}
}

return 0;
}
