/**
* @mainpage
* # Загальне завдання
* 1. **Виконати** циклічне зрушення елементів рядків масиву в напрямку справа наліво.
* @author Lavka O.
* @date 15-dec-2020
* @version 1.0
*/ 

/**
* @file main.c
* @brief Файл з демонстрацією роботи структури та методів
* оперування ним.
* @author Lavka O.
* @date 15-dec-2020
* @version 1.0
*/   
#define size 4       
void zdvig(int mas1[size][size]);
 
/**
* Головна функція.
*
* Послідовнсть дій: 
* - оголошення змінних
*      @param mas1[] заданий масив
* - вивід результату роботи @fuction zdvig
* @return успішний код повернення з програми (0)
*/
int main(){
int mas1[size][size] = {
{2, 5, 6, 8},
{1, 7, 3, 4},
{4, 8, 0, 2},
{2, 5, 3, 1}
};
zdvig(mas1);
return 0;
}

/**
* @function zdvig
* 
* Послідовність дій:
* - оголошення змінних 
*      @param mas1[] вхідний масив
*      @param mas2[] масив, який зберігає перший стовбець вхідного масива
*      @param i рядки масива
*      @param j ствобці масива
* - переносимо перший стовбець масива в інший масив для його зберігання 
* - зрушуємо елементи рядків масиву у напрямку справа наліво
* - заносимо ствобець з масиву зберігання замість останнього стовбця у вхідний масив     
*/
void zdvig(int mas1[size][size]){
int mas2[size][1];  
int i;               
int j;               
for(i = 0; i < size; i++){
   mas2[i][0] = mas1[i][0];
   }
for(i = 0; i < size; i++){
  for(j = 0; j < size; j++){
  mas1[i][j] = mas1[i][j+1];
  }
}
for(i = 0; i < size; i++){
mas1[i][size-1] = mas2[i][0];
 }
}
