/**
* @mainpage
* # Загальне завдання 
* 1. **Реалізувати** функцію, що визначає, скільки серед заданої послідовності чисел таких пар, у котрих перше число 
* меньше наступного, використовуючи функцію з варіативною кількістю аргументів.
* @author Lavka O.
* @date 15-dec-2020
* @version 1.0
*/

/**
* @file main.c
* @brief Файл з демонстрацією роботи структури та методів
* оперування ним.
* @author Lavka O.
* @date 15-dec-2020
* @version 1.0
*/

#include <stdlib.h>
#include <stdio.h>
#include <stdarg.h>

int task(int size, ...);

/**
* Головна функція.
*
* Послідовність дій:
* - вивід результату роботи функції @function task
* - @return успішний код повернення з программи (0)
*/
int main(){
printf("%d ", task(7, 2, 3, 4, 5, 6, 9, 8));
return 0;
}

/**
* @fuction task
*
* Послідовнсть дій:
* - прийом кількості варіативних чисел та самих чисел 
*	@param size кількість варіативних чисел
* - оголошення змінних
*	@param mas[] масив варіативних чисел
*	@param kol кількість пар варіативних чисел, у котрих перше число меньше за друге
* - Заповнення масиву варіативними числами
* - Послідовна перевірка чисел на виконання умови  
* @return успішний код повернення результату роботи функції (kol)
*/
int task(int size, ...){
int mas[size];
int kol = 0;
int i;
va_list ap;
va_start(ap, size);
	
	for(i = 0; i < size; i++){
	mas[i] = va_arg(ap, int);
	/*printf("%d ", mas[i]);*/
	}
	/*printf("\n");*/
		for(i = 0; i < size; i++){
		if(i != size-1){
			if(mas[i] < mas[i+1]){		
			kol++;
			}
	}
}	
va_end(ap);
return kol;
}

