
int main() {
	float num = 19.0;
	int i;
	float x1, x2, koren;
	for (i = 1; i < num; i++) {
			if (num == i * i) {
			koren = i; //квадратний корінь числа
			break;
		        
			}else if ((i*i) > num) { 
		            x1 = (((num/(i-1)) + (i-1))/2);        //допоміжна дана для формули
		            x2 = (num/(((num/(i-1)) + (i-1))/2));  //допоміжна дана для формули
		            koren = ((x1 + x2)/2); //формула отримання квадратного корня числа
		            break;    
		}
	}
	
	/*i = 1; 
	while(i < num){
	i++;
	if (num == i * i) {
			koren = i; //квадратний корінь числа
			break;
		        
			}else if ((i*i) > num) { 
		            x1 = (((num/(i-1)) + (i-1))/2);        //допоміжна дана для формули
		            x2 = (num/(((num/(i-1)) + (i-1))/2));  //допоміжна дана для формули
		            koren = ((x1 + x2)/2); //формула отримання квадратного корня числа
		            break;    
		}
	}
	
	i = 1;
	do{
	i++;
	if (num == i * i) {
			koren = i; //квадратний корінь числа
			break;
		        
			}else if ((i*i) > num) { 
		            x1 = (((num/(i-1)) + (i-1))/2);        //допоміжна дана для формули
		            x2 = (num/(((num/(i-1)) + (i-1))/2));  //допоміжна дана для формули
		            koren = ((x1 + x2)/2); //формула отримання квадратного корня числа
		            break;    
		}
	}while (i < num);*/
	
	return 0;
}
